{"run_id": "upgrade_08", "job_primary": "advocate", "url": "https://about.me/thelawsocietypakistan", "rank": 7, "retrieved_at": "2026-01-25T22:27:44.905512", "selected_bio_text": "Our Pakistani Lawyers specialize in both prosecutions as well as defense work and provide a straightforward analysis on legal issues whilst offering practical advice and representation. The Law society Pakistan law Firm is reputed law firm among Pakistani Law Firms, Pakistani Lawyers, Pakistani Criminal lawyers, Pakistani Civil Lawyer, Pakistani Business Lawyer, Pakistani Banking Lawyers and Pakistani Corporate Lawyers. the law society Pakistan Law Firm in Pakistan is a reputed law firm among Law Firms in Pakistan, Pakistani Lawyers, Pakistani Criminal lawyers, Pakistani Civil Lawyer, Pakistani Business Lawyer, Pakistani Banking Lawyers, Pakistani Corporate Lawyers, Lawyers in Lahore and Pakistani Law Firms. Our Law Firm in Pakistan prides itself in the advocacy skills of our lawyers in Pakistan. However, we also realize that success is not contingent upon the lawyer, but on the commitment and integrity he shows in his work. It is undeniable truth that forms the basis of our mission: Success through Professionalism. If you are looking for Law Firm in Pakistan, Business Registration Lawyer in Pakistan, Firm Registration Lawyer in Pakistan, Company Registration Lawyer in Pakistan, Trademark Registration Lawyer in Pakistan, Logo Registration Lawyer in Pakistan, Copyright Registration Lawyer in Pakistan, Contract Enforcement Lawyer, Debt Recovery Lawyer, Insurance Lawyer, Property Lawyer in Pakistan, Property Consultants in Pakistan, Sale Deed Registration, Documents Verification Services, Divorce Lawyer in Pakistan, Khula Lawyer in Pakistan, Child Custody Lawyer in Pakistan, Family Lawyer in Pakistan, Import & Export Laws in Pakistan, Drugs Lawyers in Pakistan, Cheaque Dishonored issue 489 F PPC, Criminal Lawyers in Pakistan, Civil Lawyers in Pakistan, Bail Matter, Legal advice or any legal matter, You have come at the right place. The Law Society Pakistan Law Firm in Pakistan deals in all these matters with professionalism. We practice these laws in Pakistan. Banking Laws of Pakistan, Business Laws of Pakistan, Family Laws of Pakistan, Civil Laws of Pakistan, Commercial Laws of Pakistan, Company Laws of Pakistan, Construction Law of Pakistan, Customs Duty Laws of Pakistan, Defamation Laws of Pakistan,Design and patent Law of Pakistan, Dispute Resolution Laws of Pakistan, Divorce Laws of Pakistan, Sales Tax Laws of Pakistan, Sale of Goods Laws of Pakistan, Taxation Laws of Pakistan, Trademark Laws of Pakistan, Administrative Laws of Pakistan, Adoption Laws of Pakistan, Arbitration Laws of Pakistan, Aviation Laws of Pakistan, Contempt Laws of Pakistan, Contract Laws of Pakistan, Copyright Laws of Pakistan, Corporate Laws of Pakistan, Criminal Laws of Pakistan,Partnership Laws of Pakistan, Patents law of Pakistan, Property Laws of Pakistan, Real Estate Laws of Pakistan, Birth Registration Laws in Pakistan, Death Registration Laws in Pakistan, Court Marriage Laws in Pakistan, Child Marriage Laws in Pakistan, The Power of Attorney Act of Pakistan, The Partition Act of Pakistan, The Pre-emption Act of Pakistan, The Administrative Law of Pakistan, The Arbitration Act of Pakistan, he Foreign Exchange laws of Pakistan", "word_count": 466, "quality_score": 466, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "animator", "url": "https://about.me/henribrownell", "rank": 7, "retrieved_at": "2026-01-25T22:29:13.163668", "selected_bio_text": "Being a character animator is all I have ever really wanted to be. From the early years of watching Disney movies and the finding out that computers could be incorporated as a new tool, I found that I would be in heaven if I studied hard and dedicated myself to that goal. The path has been extremely challenging but so rewarding. I really can't imagine myself doing anything else for a career. Knowing the tools of the trade is only the beginning of understanding. Learning to utilize those tools to bring the characters to life has been my focus for some time now. Continuing education is very important to me and is one reason I try to stay active in the community by giving and receiving critiques on ACME Animation, 11 Second Club, and even in LinkedIn groups that I belong too. In learning to receive and give critiques, I gain valuable knowledge and appreciation for my craft and it has had an incredible impact on my skills. As I gain a more critical eye, my perceptions and understanding allows me to see more in the work I produce and review. My skills continue to improve and even my critiques at ACME earned the privilege to be a guest lecturer at schools to talk about being a student and working professional to help teachers in their criteria of how they approach students animation education. Being part of the community means also being involved within the community. Along with donating time to helping young animators grow their skills, I also try to attend meetings for ASIFA Hollywood, SIGGRAPH conventions, and the CTNX expo every year! These opportunities afford me the ability to see the latest in technology and keep up with the trends being set for today and tomorrow! I have met a number of friends and continue to grow my network of animators. Meeting and working with new people is always a thrill and I do my best to make the most of it. There are many interests and hobbies that I have that I enjoy when I am not at my computer animating. I think that being a more diverse and active person helps make me a better person, and animator. Swing dancing is one of my favorite pass-times! To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 400, "quality_score": 400, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "artist", "url": "https://about.me/camplte", "rank": 9, "retrieved_at": "2026-01-25T22:30:35.210368", "selected_bio_text": "Biography I was born is South Bend, Indiana and was raised in Kentucky. I am a son of a coal miner and a home maker, and they encouraged me to go to college and seek my own way. I felt pressured to be a business major and to work with my hands, so I compromised by seeking a graphic design degree while taking as many painting and drawing classes as possible, plus I felt the need to get a philosophy minor. Although I worked under some Logical Positivist philosophy professors, I came out of the program with a more Existentialist world view. Sartre and Camus were my main focus and my paintings and pastels were based on my emotional responses to my friends and surroundings. A Picasso and then a Matisse show at High Museum in Atlanta were great influences on my early work. After completing my BFA I spent about two years in Philadelphia. While there, I started to read a variety of fiction from the beat generation and some new contemporary fiction. Then I moved to Dallas, and Texas is where everything changed about me and my art. I left my art based on emotional content in favor of a conceptual, intellectual bent. I helped to foster that slant through seeking an MA in Arts and Humanities at UTD. There I meet several professors who helped me develop my ideas, but one in particular helped to reinvent my approach. John Pomara is the professor that reminded me that I had rejected the tools of graphic design and those tools were going to waste. I started to incorporate computer based art into my work along the lines of Derrida's deconstructing text theories. Then I traveled to NYC for a week to see the Armoury show. Seeing all that work presented in such a professional setting, the art fair inspired me to use industrial printers and materials. Finally, I felt ready to seek my MFA and I applied to only one school, the University of North Texas. I had my eye on the university for a long time, so I only wanted UNT. Vincent Falsetta and Annette Lawrence were the two artists that I really wanted to work with, but once I found myself in the program, I found that all the painting and drawing professors were very helpful to develop my ideas, style, and work ethic. When I came to the end of my MFA program I had the epiphany that my work was directly linked to my problems with dyslexia. Words have always posed a challenge for me to understand because words partly act as a space between an object and meaning. That tension has been inspiring me to build these im To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 474, "quality_score": 474, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "baker", "url": "https://about.me/cecilraybaker", "rank": 1, "retrieved_at": "2026-01-25T22:31:42.810569", "selected_bio_text": "Cecil Ray Baker, a dedicated professional based in Elgin, Texas, has gained recognition for his notable journey on American Idol. Currently, he is actively involved as a machine operator, contributing to various aspects such as the construction of private roads, brush clearance, and the maintenance of livestock in the Elgin area. Music's profound impact on Cecil Ray Baker's life goes beyond a mere passion; it is a calling he believes is meant to be shared with others. Fueled by a genuine pursuit of happiness, Cecil endeavors to create music that resonates and brings joy to those who listen. This dedication to his musical craft was evident during his participation in American Idol, where Cecil chose to compete specifically under the country category, showcasing his deep commitment to the genre he holds close to his heart. Cecil Ray Baker's journey on American Idol saw him advance to the Top 64 with a standout rendition of Leon Bridges' \"Beyond.\" His impressive performance secured him a spot in the Top 24. Cecil chose \"Paint Me a Birmingham\" by Tracy Lawrence for his next performance. Despite his efforts, he did not gather enough votes to proceed further, ending his American Idol run. One of his biggest hurdles was the “genre challenge,” which pushed contestants out of their comfort zones. This challenge was particularly daunting for Cecil as it was only his second time on stage. Nevertheless, he stayed focused on his goals and pushed through, showcasing his determination and talent. In addition to his artistic endeavors, Cecil Ray Baker possesses a keen interest in the business realm. Drawing inspiration from his experiences and challenges, he has cultivated a pragmatic understanding of entrepreneurial dynamics. Whether leveraging his skills professionally or exploring entrepreneurial opportunities, Cecil brings a strategic mindset. His business insights go beyond the conventional, reflecting a versatile approach that aligns with his diverse interests. Cecil Ray Baker’s foray into the business world underscores his adaptability and highlights his commitment to exploring and excelling in various aspects of life. To learn more about Cecil Ray Baker, visit CecilRayBaker.com.", "word_count": 343, "quality_score": 343, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "barista", "url": "https://about.me/intanlay", "rank": 5, "retrieved_at": "2026-01-25T22:32:48.583074", "selected_bio_text": "I am currently a Journalism and Media and Communication student at Deakin Universtity. I hope that my studies would lead towards a career in the industry of publication in the areas of make-up, fashion, beauty or sport. In my spare time, I work as a Barista and model. Coffee is an art and modelling is a passion that I greatly respect. Making coffee is something that i love doing and almost a gift i love giving. There's nothing i enjoy more than seeing a person take their first sip of the day and exhale a sigh of satisfaction. I do have a great appreciation for cars. I think they are immaculate creations that should be taken advantage of. You could find me modelling or doing promo-work at a lot of car shows, just to squeeze in a perve at impressive European vehicles. I love sport. I love watching and being a part of it. I love competition and i love adrenalin. Rugby, football and volleyball would be the ultimate sports in my eyes and the main sports worth watching as well as playing. You will usually find me on my phone or ipod tapping away into games such as sodoku, solitaire, chess or 4pics1word. Games that stimulate thinking, problem solving and strategic planning take preference above all else.", "word_count": 218, "quality_score": 218, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "biker", "url": "https://about.me/a2a", "rank": 3, "retrieved_at": "2026-01-25T22:33:43.755130", "selected_bio_text": "Brian Peric endurance Mountain Bike TESoL instructor, Adventure cyclist, Motorcyclist [Retired] after five (5) North American solo-marathons between [PHONE]. In 60 days, I traveled 24,000Km. Now an English Teacher in South Korea. HIMALAYASX2011 I have cycled across western China deserts and the Himalayas in 3200km in 38 culturally rich days. I chronicled my expedition in video, journal and photography while crossing the Tian Shan Mountains, expansive deserts of Xinjiang Uighur East Turkestan, the 552km north-south route across the Taklamakan Desert. I journeyed along the old southern Silk Road through Poplar trees and Uighur villages eating explosive watermelons, speaking to locals in 3 languages and enjoying an epic mountain bike ride. I entered the Aksai Chin mountains over 3000 meters above sea level and rode unpaved roads through the desert, past camels, past small mountain villages, into military areas along the Pakistan borders before being removed by Chinese military once detected. Stage two: I cycled 600km back to Kashgar on the northern Silk Road and continued my route from Chengdu, Sichuan to the Himalayas on another unique route I read through maps. I weaved through 3-4500 meter peaks and dined with Nomadic Tibetans, Sichuan, and Yi peoples once I crossed the Yunnan borders at Lugu Hu, a magnificent lake at 3000 meters altitude. Yunnan province weaving through a variety of landscapes, 4000 meter tunnels, into homes of locals and wild camping everywhere for the nights. MONGOLIAX2012 I cycled and trekked on foot solo and unsupported across 2500km 1553 miles of Outer Mongolia. 2500km in 38 cycling days, +7 days rest and injury days. Mongolia being so geographically and culturally rich and topographically humbling, my route traced across the mountainous Steppe plateau altitude +- 40,000 meters +- 131,134 feet (twice altitude gain summit of Mount Everest from sea level) on a unique route I planned myself. 1 year of painful physio and recovery. Mongolia was the most exotic trip I have taken to date. A warm Nomadic and pastoral culture that lives sparsely populated across 1,557,000 sq Kilometers of arid Steppe close to their land, animals, and mother nature. Although Mongolians have long endured and suffered under Soviet and Chinese, they are a free people and their land is sacred to them too. TOTHEROCKTOUR In 2013, I completed a third bicycle to Lake Louise, Canada. 3400km 2000 miles in 30 days reconnecting to my homeland c To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 414, "quality_score": 414, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "buyer", "url": "https://about.me/howtosellmyhousedetroit", "rank": 7, "retrieved_at": "2026-01-25T22:35:04.061313", "selected_bio_text": "How To Sell My House Detroit? Want to know How To Sell My House Detroit? Are you wondering how to sell my house Detroit? If so, you have come to the right place. Many homeowners in Detroit choose to sell their homes through a real estate agent. This process is quite lengthy and takes between 4-7 months depending on the market conditions. If you want fast cash for your property, this isn’t the best way to sell it. Cash home buyers have become quite popular in Detroit because they buy houses fast and as-is. You will get top dollar for your property as-is when you choose to sell it to a cash buyer in Detroit. This article provides information on why you need to find a reliable cash home buyer in Detroit to sell your property quickly and for top dollar. A high percentage of filed home sales in Detroit is because the potential buyers are unable to secure a mortgage. Even the buyer had a pre-approval for the loan, the lender can still decide not to go ahead with the mortgage for numerous reasons. That’s where a cash buyer comes in handy. In fact, a cash buyer is not looking for a mortgage to buy your house. Hence, the sale is more guaranteed and there is no risk of any mortgage issue when you choose to sell the property to a cash buyer. A cash buyer doesn’t have to wait until someone else buys his property to invest in your property. In fact, there are very few people in the buying chain when you go with a cash home buyer. The transaction will run smoothly and the sale of the property will go through as planned when you choose a cash buyer to sell your house in Detroit. The process is extremely quick and involves only a few steps compared to selling through a real estate agent. The first step is to contact a reliable cash home buyer in Detroit by calling one of them or visiting their website. An expert from the company will visit your property and evaluate it. They will make an offer that you won’t be able to resist. The offer is based on the condition of your home and the market price in the area. Once you agree with them, they will close the sale within 2-7 days depending on your schedule. You can decide when you want to close the sale when you sell the house to a cash home buyer in Detroit. That’s why you need to choose a reliable cash home buyer in Detroit to sell your house fast.", "word_count": 438, "quality_score": 438, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "cardiologist", "url": "https://about.me/dr.giovannicampanile", "rank": 6, "retrieved_at": "2026-01-25T22:36:09.290141", "selected_bio_text": "Dr. Giovanni Campanile is a well-respected cardiologist with extensive experience in modern cardiology treatment and techniques. Since 1999, he has headed two separate cardiology practices, serving at Montclair Cardiology Group, P.A., of Glen Ridge, New Jersey, as Chief of Cardiology and Managing Partner. He also works as Cardiac Catheterization Lab Director at Advanced Cardiology of Key West, located at Lower Keys Medical Center. Dr. Giovanni Campanile's Florida practice has developed an advanced cardiology center and is affiliated with Columbia University's Division of Cardiology at Mount Sinai Medical Center in Miami. At both practices, Dr. Campanile embraces a whole-patient approach, educating patients on nutrition as prevention of heart disease, as well as keeping the disease manageable in patients already in treatment. Dr. Campanile has moved his New Jersey practice to The Cardiology Center of New Jersey, 50 Newark Ave, Suite 204, Belleville, New Jersey, 07109; and 123 Highland Ave, Suite G2, Glen Ridge, New Jersey 07028, telephone (973) 450-2158. Dr. Giovanni Campanile gained extensive knowledge and experience at such well-known hospitals as Saint Barnabas Medical Center, Mountainside Hospital, Lenox Hill Hospital, and Columbia University Medical Center. In addition to clinical practice, Dr. Giovanni Campanile holds a post as Assistant Professor of Medicine with Columbia University's division of cardiology at Mount Sinai Medical Center. He also serves at the University of Medicine and Dentistry of New Jersey, as Assistant Professor of Medicine. Dr. Giovanni Campanile has an advanced degree in nutrition from the Institute of Integrative Nutrition. He is President of the Monroe County Medical Society and Director of the Cardiac Catheterization Laboratory at Lower Keys Medical Center, Key West, Florida. Dr. Giovanni Campanile started the invasive cardiology program in Key West, which has one of the highest success rates and lowest complication rates in the nation. Additionally, he performed the very first heart stent procedure in the Florida Keys and started a very successful radial artery (wrist artery) catheterization program, which increases patient comfort and reduces complications. At Harvard Medical School, Dr. Giovanni Campanile undertook a fellowship in clinical and interventional cardiology, completing it in 1991. During his f To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 368, "quality_score": 368, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "carpenter", "url": "https://about.me/kaybcarpenterjoseph", "rank": 1, "retrieved_at": "2026-01-25T22:37:17.672358", "selected_bio_text": "Kayb has been drawing, sewing, dreaming, building, and arranging since childhood. Her curiosity about the world has taken her through various media and across many continents. As a third generation artist she has an innate sense of the beautiful and a keen sense of craft. As a fourth generation international traveler she is an adventuress ever curious about new people and places. She grew up in a rural community in the mountains of Oregon which developed her commitment to place and community. Reflective by nature her work is inspired by her experiences of people, place, and her maker. Art is my way of being curious about the world, figuring things out, and talking to others about it. I experience life as a constant tension between polarities: Reaching for the sacred but mired in the profane; loving this place and these people but feeling an unrelenting homesickness for a place I've never been; beguiled by beauty yet uncomfortably aware of impending tragedy; nurturing the intentional and reflective life while living in a world of immediate gratification and the practical. Thus, I often feel disoriented. My art flows from this disorientation and my rooted loves--another polarity. I am ever fascinated by embodiment. I trained as a classical sculptor to understand the body and what makes it one of the most beautiful creations on earth. That fascination has grown into the use of space and visual metaphor to explore the social, psychological, and spiritual experience of embodiment. It sounds rather weighty and profound, really its just me processing my experiences and hoping it will create a point of mutual understanding and communication between myself and the viewer. An effort to be intimate in a world that makes us feel alone. Other times, I make work for the shear pleasure of it. Just because I am interested in an idea or an image or I find something beautiful. I want to see something in my head in the world, to be a harbinger of beauty. There is nothing intentionally profound about it except that I have a love for something and I get intrigued. Often my best work begins here. I suppose that is the well spring of all good work, no matter the vocation. I suppose if there is anything that I suffer from its that I possess too much Love, Creativity, and Curiosity. Its the part of me that is still a child. In this way, I hope I never grow up, though I hope my art will.", "word_count": 416, "quality_score": 416, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "cinematographer", "url": "https://about.me/paulwildman", "rank": 7, "retrieved_at": "2026-01-25T22:38:16.475422", "selected_bio_text": "Paul Wildman is a talented filmmaker who has spent more than a decade as a cinematographer, producer, editor and animator, and most recently director of photography. His efforts have been featured globally in several broadcast productions and on the big screen, and he possesses glowing recommendations from production studios all over the world. Paul is also a highly specialized and trained underwater cinematographer, having spent over 4,000 hours filming underwater in many challenging conditions, more than 1,500 of those filming dangerous sharks – outside of any cages without protection. Only a handful of other people around the world have the expertise, experience, skills, or time logged that Paul does – particularly with large predators. His stunning world-class shark footage is widely known and has been featured on Discovery’s Shark Week, National Geographic, ABC World News, and Animal Planet. Combining a broad range of shooting, editing, animation, new media, technology and drawing skills, he is in a unique position – able to deliver high quality visual efforts while bringing innovative approaches to his work. With over 13 years filming, editing and field producing commercial advertising, films, television, and independent projects, he has worn many different hats and has a wealth of experience from which to draw upon – for any type of production. With a passion for diving and filming underwater, in 2004 he started Lkwid (www.lkwid.com), an underwater production studio. Paul perfected his underwater cinematography skills, developed unique skills filming with the oceans top predators, and also trained dozens of locals as well. He sold it in 2009, to start Built By Wildman, (www.builtbywildman.com). Paul leverages his commercial filmmaking background, as well as his unique experience and training in outdoor skills and dive instruction and underwater filmmaking, to deliver adventure and nature content that is edgy and exciting, challenging the boundaries of production. His diverse range of skills includes underwater and topside camera work, 2D animation, editing, sound, field production, and multimedia, making him a valuable part of a any team. Undoubtedly, his star is rising, as he has just finished shooting a documentary for a filmmaker, Rob Stewart, whose last film, Sharkwater, won 35 awards and works closely with other Emmy nominated and award-winning producers, directors and cinematographers. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 389, "quality_score": 389, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "collector", "url": "https://about.me/kennethgoldmanrarecoins", "rank": 9, "retrieved_at": "2026-01-25T22:39:26.133238", "selected_bio_text": "A wide contributor within the industry, Kenneth Goldman has been a leading dealer and trader of rare coins, paper money and antiques for over 50 years. Ken Goldman has helped individuals assess product value, avoid unprofitable transactions, and complete specialty collections. Serving as primary dealer with his independent agency since age 18, Kenneth Goldman has established intimate ties to collectors and dealers across the nation and has handled millions of dollars worth of rare coins. Kenneth Goldman is a member of the Round Table Trading Group--the Largest & Most Trusted Network of Coin Dealers in the World. As well, Mr. Goldman is a lifetime member of the American Numismatic Assoc. (For over 50 years), member of the Professional Numismatics Guild for over 35 years ([PHONE]) and membership with virtually all major numismatic organizations, Mr. Goldman began collecting coins at the age of six and started trading rare coins by age 10. Continuing to attend national coin conventions and auctions today, he attends nearly all industry events held in the United States. Earning his qualification as an expert witness for the Federal Trade Commission and the New York Attorney General’s office, he has appraised and valued rare coins for government agencies and individuals. Mr. Goldman is a long term member of the Professional Coin Grading Service and to the Numismatic Guaranty Corporation. Since 1975, he has contributed his knowledge to A Guidebook of United States Coins, helping establish the publication as the country’s numismatic standard. Mr. Goldman has been consultant to rare coin dealers, auction houses, as well as private collectors. Kenneth Goldman is an avid collector, writer, and researcher of other specialty pieces, including automatic musical instruments, antique slot machines and trade simulators, Wedgwood pottery, musical and automated pocket watches, and snuffboxes, among other collectables. For his efforts, he was afforded a position as consultant and cataloger for Sotheby’s, Christie's, as well as Bonhams Auction Galleries. Kenneth Goldman is well qualified to assist in formation and liquidation of coins and other collectibles. We give free rare coin appraisals to individuals located in the Newton, Needham, Westwood, Dedham, Dover, Norwood, Wellesley, Walpole, or Weston areas as well as throughout the USA.", "word_count": 360, "quality_score": 360, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "college student", "url": "https://about.me/alexandrahilliard", "rank": 1, "retrieved_at": "2026-01-25T22:40:26.168572", "selected_bio_text": "Hey all! My name's Alexandra, and I am junior at Green Mountain College in Poultney, VT. I am a biology major and intend to go to medical school. I am a non-denominational Christian and often attend the services at the Methodist church in Poultney. I am on Student Senate as a Jr. Class Representative. I am also a member of Pre-Med/Pre-Vet club and Green Mountain College's Women's Rugby Football Club. I play soccer and lacrosse at GMC. I work in town at Shaw's in the mornings and on weekends. On the weekends, when I don't have games or work the next day, I like to go to the local bar with my friends from work. I also like to go on car rides, familiarizing myself with this beautiful area. I live on campus, but spend most of my time in town with my boyfriend and his family. We have a kitten named Lionel, he's a sweet tabby who loves to talk! I like to read classic literature, play guitar, and sing. I also like playing video games, especially ones with zombies! When I have room to take extra credits each semester, I usually opt for music lessons or philosophy classes, because they're really cool! Psychology really interests me too. I'm kind of conservative, and deeply religious. At this point in my life, I am on an intense religious journey. I'm originally from Brockton, MA. It's a city of one hundred thousand people, and is a low-income, urban area. In high school I ran track, my events were the 55m dash, 55m hurdles, 100m dash, 100m hurdles, relays, and long jump. I was a John & Abigail Adams scholar. My favorite classes in high school were Ecology and Latin! I have two brothers and a sister. My oldest younger brother attends the University of Massachusetts Amherst where he is on a football scholarship. My parents are in college too, they both enrolled after my first semester, so when I first came to college I was a first generation college student. I love my hometown, and visit as often as I can. At this point in my education I am taking as many rigorous classes as I can, and getting as involved on campus as is possible without having a mental breakdown! I am also getting ready to take the GRE and MCAT, and am getting to know the application process for graduate and medical school admissions. Some fun facts about me: I am African-American, love the color green, speak Haitian Creole, am afraid of beetles, and like listening to country music.", "word_count": 430, "quality_score": 430, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "comic", "url": "https://about.me/kraigrasmussen", "rank": 3, "retrieved_at": "2026-01-25T22:41:02.085823", "selected_bio_text": "Kraig Rasmussen is: A freelance illustrator, creator, writer. A sometime Bay Area resident. A part time denizen of Hollywood. Enthralled with story for it’s life-decrypting magic and cathartic process, I embraced the skills of story craft from a very young age, eschewing all other destinies. Since 2004 I’ve been self-publishing comics, beginning with “Mothspy”, learning on-the-go, and in the interim, attending the Academy of Art SF for fine art/illustration. I am currently working to tell a handful of developed, personal stories, try my hand as an art gun-for-hire, and make my first feature film. I am a regular participant/volunteer at The Cartoon Art Museum in San Francisco, a frequent speaker in the DIY seminars at the Alternative Press Expo SF, and an occasional guest artist at events such as “Nightlife” at the California Academy of Sciences. Recently, I was given the opportunity to provide illustrations for Ronin Studios’ The Great Cycle #1. The mystical adventure bent of it immediately drew me in, as well as the chance to draw lavish Mayan ruins and costumes. I spend a lot of my free time researching history and culture, I love me a good National Geographic experience, and enjoy speculating on, (possibly embellishing), our cultural origins for the sake of fiction. This story felt like a natural move for me. In addition, I am a contract artist, providing illustrations and fine art for a variety of businesses and private clients, ranging from single illustrations and comics, to oils on canvas and watercolor. My current projects include two different independent comics, and readying the revamp of my website monkeygong.com for my own brand new web-comic “The Secret Origin of Dylan Drake”. Once my web-series concludes, I am aiming at June for the start of an approved kickstarter campaign for the upcoming (and half done) OGN “Rocketboy: In the Radio Zone”. [So please stay tuned on that!] Fun and relaxation for me entail movies, interwebs, music, dancing to deep bass and hard beats, climbing, martial arts, my cat, human relationships. I enjoy the tweeting quite a lot, though I am intermittent. Podcasts: HUGE fan of the nerdist podcast and network of shows, Kevin Pollak’s Chat Show, star-talk radio with Neil Degrasse Tyson, inkstuds, and sidebar nation, (and I’m always looking for more!) To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 397, "quality_score": 397, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "consultant", "url": "https://about.me/elaineschoch", "rank": 6, "retrieved_at": "2026-01-25T22:42:04.292876", "selected_bio_text": "I’m Elaine Schoch (pronounced Shock). I began writing Carpe Travel after I left the corporate world and began life as a self-employed public relations and marketing consultant. You see, I started to see life a little differently and needed to change things up. A few years earlier my dad had been diagnosed with aggressive lung cancer and died a few weeks later (yes, weeks). His “someday I’ll do this or that” never happened. My first “someday” happened a few months later when I became a causality of the tech bubble bursting and lost my job. It was time to go somewhere. See something new. Unfortunately, or maybe fortunately depending on how you look at it, I had just bought my first house, so I couldn’t really strap on my backpack and “take off”. So I settled for hitting New Orleans for Jazz Fest. I made my “someday” list on that trip and started making things happen when I got home. It took a few years to save the cash but by then I also had enough professional experience (and contacts) to make a living doing consulting. And so I do. I’m now married to “The Husband” and we have two little Princesses, Princess One and Princess Two. You’d think our traveling days would have slowed down, on the contrary. The Princesses are two very well traveled little people who now help map out our destinations and activities. But, there are still those “no kids allowed” trips that continue to be added to the new “make it happen” list. And so we do a lot of traveling without the kids as well. I mean really, there are a lot of places one just does not want to take kids, albeit I have been known to take them to five-star restaurants and wine tastings. In addition to Carpe Travel, I handle public relations and social media initiatives for several technology start ups. I also am involved with Social Venture Partners and sit on the board for Denver Urban Scholars, a nonprofit organization dedicated to helping metro Denver students with the greatest need graduate high school and enter higher education. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 377, "quality_score": 377, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "dancer", "url": "https://about.me/katherinecrockett", "rank": 7, "retrieved_at": "2026-01-25T22:43:14.508704", "selected_bio_text": "Katherine Crockett began studying dance at the age of 4. At 14 she joined Ballet Met. At 16, she moved to New York to attend S.U.N.Y. Purchase and the Martha Graham School . She joined the Martha Graham Dance Company and quickly rose to the rank of Principal dancer and danced and toured internationally with the company for 21 years.Crockett starred as The Queen in the Off-Broadway immersive theater hit, Queen of the Night, for which she created and choreographed her role.She is Cate Blanchett's dancer double in The Curious Case of Benjamin Button starring Blanchett and Brad Pitt, directed by David Fincher.Crockett is featured in a scene with Meryl Streep​ in the film \"Ricki and the Flash\" directed by Jonathan Demme.Crockett played Helen in SITICompany's production of Trojan Women ( after Euripedes) , directed by Anne Bogart.She is the star of Fall to Rise, award winning feature film written and directed by Jayce Bartok, co-starring Daphne Rubin-Vega, Tamara Tunie and Desmond Richardson.She starred alongside Mikhail Baryshnikov as Helen in Richard Move's \"Achilles Heels-The Show\".She has been televised in Martha Graham's Appalachian Spring (PBS), Herodiade (PBS), and the iconic solo Lamentation (BBC). She performed Lamentation for Kosovo's Return festival hosted by Vanessa Redgrave.Crockett performed as Amneris, in Placido Domingo's \"Aida\" with the Washington Opera choreographed by Nilas Martins. She has also been featured in works by Robert Wilson, Lucinda Childs, Martha Clarke, Larry Keigwin, Yvonne Rainer, Susan Stroman, and Anne Bogart .Crockett has performed at the Cannes Film Festival, the VH1/Vogue Fashion Awards, and the Gala of the Stars. She has performed on the runways of Alexander McQueen, John Galliano and Victoria's Secret and modeled for such esteemed photographers as Herb Ritts, and Albert WatsonMs. Crockett starred in Richard Move's film Bardo, ( Lincoln Center Dance on Camera Festival in 2009) and collaborated with filmmaker Caroline Koebel in the film 'Grand Central'. She starred in the film (Black) Light by Dierdre Towers, shown as a part of the 2011 Dance on Camera Festival. She starred in Salome, a dance film by Stephen Pier, filmed by Yaniv ( Nev) Schulman ( Catfish))'. She played the lead role in And I Will Rise If Only to Hold You Down, by Jennifer Reeder. She was featured in the short film 'The White Box\" by Micheal Bassett. Crockett choreographs, dances, and performs internationally. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 409, "quality_score": 409, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "designer", "url": "https://about.me/themariahphillips", "rank": 5, "retrieved_at": "2026-01-25T22:44:14.832284", "selected_bio_text": "I'm an East Coast transplant residing in Los Angeles, California. My passion for art and design pushed me west in pursuit of my design career. I am a young, driven, and eager artist with 4 years of design experience under my belt and the confidence to take charge in any situation. My weapons of choice are Adobe Photoshop, Illustrator, Fireworks and Indesign. Much of my drive comes from new experiences and the ability to build myself and to grow, professionally and creatively. I attended Castleton University in Vermont, where I was able to establish a solid foundation for an array of art mediums and begin to develop my design techniques. While in school I was hired as the school paper’s layout designer. While working there I was responsible for the composition of the paper, editing, meeting tight deadlines and making sure the arrangement was correct and functional. My fervor for design led me to a design internship at Awesome Graphics in Rutland Vermont. Since graduating I have emerged myself into freelance; I was able to gain an array of clients. In 2013 I was hired as a Freelance Designer for the Vermont Brewery Festival. The Event Director contracted me to edit their information booklet as well as re-design badges for the employees. Project duration was 3 months and was all Indesign based. In 2014 I was contracted by White Flag Sales as their Freelance Graphic Designer. Projects for them included promotional event designs with collateral apparel and social media graphics. This connection lead me to collaborate with Burton Snowboards and Mizu Water bottles. The last two years I have designed the shirts and promotional material for Slash and Berm, an annual banked slalom that is sponsored by Burton Snowboards, Killington Mountain Resort, and the Molly Fund. Through Mizu I was able to collaborate with accounts throughout New England to create unique bottle designs for their company. I'm a perfectionist, but not rigid with my designs. I posses a keen eye for detail, craftsmanship, creative thinking, and a thoughtful approach to everything design. I'm always on the lookout for any projects, be they small or large", "word_count": 355, "quality_score": 355, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "doctor", "url": "https://about.me/atefzakhary", "rank": 2, "retrieved_at": "2026-01-25T22:44:46.479823", "selected_bio_text": "Dr. Atef Zakhary laid the groundwork for his career in medicine in Egypt at Cairo University. There, he completed his Doctor of Medicine and then satisfied his internship requirements at Cairo University’s Kasr El Ainy Hospital. Dr. Zakhary spent the next four years in internship and residency in Egypt, receiving valuable training in obstetrics and gynecology before immigrating to the United States. Doctors who train abroad must acquire certification to practice in the United States. Dr. Atef Zakhary completed the Foreign Medical Graduates Examination in the Medical Sciences (FMGEMS), thus earning the right to practice medicine in the country. At one point, he held licensure to practice medicine in three states, Utah, New Jersey, and Florida. In addition, he displayed the competencies required to become Board certified in Internal Medicine (since 1998) and Obstetrics and Gynecology (since 2005). Dr. Zakhary holds a number of distinguished professional memberships, chiefly as a member of the American Medical Association. Dr. Atef Zakhary is the President and Lead Physician at the Omni Medical Center for Women, specializing in high-risk pregnancies, including induced labor and birth by Caesarean section. Since opening his practice in 1999, Dr. Zakhary has provided Tampa-area women with quality medical service. Drawing on his 25 years of experience in OB/GYN, Dr. Atef Zakhary and Omni Medical Center for Women are one of Tampa women’s top picks for OB/GYN services, coming in at number two on RateMDs.com. Dr. Atef Zakhary is the only doctor in the Tampa Bay area who offers his patients vaginal birth after Caesarean section (VBAC). In addition, he performs high-order Caesarean deliveries for patients who have had more than three prior Caesarean sections, and holds a record of performing the eighth Caesarean section at Tampa General Hospital. He accepts morbidly obese patients with maternal weights of 500 or more pounds who are unable to procure prenatal care elsewhere. In his free time, Dr. Atef Zakhary enjoys coaching basketball at a local middle school, donating his time and service to Tampa Mayor Bob Buckhorn, and playing bridge. A multi-talented individual, he once played bridge professionally and is fluent in Arabic.", "word_count": 351, "quality_score": 351, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "driver", "url": "https://about.me/driversupport", "rank": 3, "retrieved_at": "2026-01-25T22:45:48.329861", "selected_bio_text": "Statistically, 90% of Americans who own a computer-based gadget are bound to encounter driver-related issues. This is exactly the area of expertise for the Austin-based company founded in 1996, Driver Support. The company’s expert team currently services over 600 device manufacturers and resolves more than 5,000 support requests every single day in countries around the world. The universal software and associated services company changed the IT landscape by introducing cutting-edge driver scanning technology, driver update enterprise software, and customizable user interfaces. This highly specialized approach has enabled the expert team at Drivers Support to help customers save time by simplifying the search, selection, and installation processes that are necessary to find and install the right drivers for PC devices. The result is a streamlined and transparent download process that provides customers with drivers for almost all major manufacturers, improving computer performance and usability. Driver Support has developed an innovative approach to diagnose and resolve PC issues resulting in optimization of the overall PC performance. Accurate driver matching plays a significant role in the success of this process, which is why Driver Support has created a robust, industry-leading database, which has become the most accurate match system available on the market. Based on their ingenious proprietary software for use in customizable user interfaces, Driver Support has developed a tool that can be easily downloaded by customers and put to use immediately. No matter whether a customer just connected a new device, like a printer or a webcam, needs new drivers after re-installing Windows, or is troubleshooting a driver-related issue, Driver Support is there to assist and speed up the process. Live-assisted installation of the first driver with a service professional is absolutely free for all registered customers and members that enroll in a one-year subscription for only $29.95 who can use the tool in a fully unlocked mode, update their system on a regular basis, and monitor for specific plug and play events when a driver may be needed. Registered users receive free professional tech support that can be contacted through a variety of channels, such as email, phone, and remote screen sharing. The real-time support team is available to help customers, with services that include accurate and comprehensive diagnosis to assess the sta To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 393, "quality_score": 393, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "elder", "url": "https://about.me/sabrinarlewis", "rank": 4, "retrieved_at": "2026-01-25T22:47:02.455325", "selected_bio_text": "Sabrina Renee Lewis was born on September 12, 1977 to John Henry and Mary Carol Lewis. She is a native of Queens, NY and is currently a resident of Fuquay-Varina, NC. Elder Lewis is a graduate of the University of North Carolina at Chapel Hill with a Bachelor of Arts degree in psychology. It was during her matriculation that she had a life-changing encounter with Jesus Christ and dedicated her life to Him. At the age of 19, she began her journey toward ministry and purpose, serving in numerous capacities within her local church and community. In April 2011, Elder Lewis was elevated and now serves as Associate Pastor at The Dream Center Church of Raleigh, under the direction of Bishop J. Donald Edwards, Jr. and Pastor Erika G. Edwards. Having a heart for those who are new to ministry and trying to find their way, she plays a critical role in the training, development and encouragement of upcoming leaders, armor bearers and adjutants. Quickly becoming known for her prophetic accuracy and an anointing to bring about deliverance and encouragement, Associate Pastor Lewis has been chosen by God to preach and teach the uncompromised Word of God. Her personal ministry endeavor, A Word in Season Ministries, is based on Isaiah 50:4 \"The Lord GOD hath given me the tongue of the learned, that I should know how to speak a word in season to him that is weary\". Elder Lewis believes that anyone who is weary or discouraged, no matter the cause, can find life, restoration, healing and renewal in the Word of God, and seeks daily to speak such a Word into the lives of those who have been forgotten and disregarded. Elder Lewis also ministers as a psalmist, and serves as praise and worship leader at The Dream Center Church of Raleigh. She has utilized several opportunities to record professionally, and has sung background vocals for several local and national recording artists. Of all her accomplishments, Elder Lewis considers motherhood to be one of her greatest achievements. She is the proud mother of Abijah Samuel, born April 12, 2001. Elder Lewis continues to be committed to a life of service to God and to His people", "word_count": 368, "quality_score": 368, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "engineer", "url": "https://about.me/ericpeterka", "rank": 8, "retrieved_at": "2026-01-25T22:48:05.121246", "selected_bio_text": "I’ve always been an engineer, more specifically an automotive engineer. Before I could walk, I was disassembling Hess trucks. Next: building everything under the sun with Legos. By the time I was 15, I was assembling junior dragster race engines. In 2014, I graduated from Virginia Tech with a Bachelors Degree in Industrial and Systems Engineering, with a minor in Green Engineering. In the classroom, I specialized in mechanical and automotive problem solving, statistical systems, event simulation, and even management and leadership. But it has been my out-of-classroom experience that defines me. Playing the role of Ergonomics sub-team leader on the Virginia Tech Formula Team, (Society of Automotive Engineers - Industrial Systems Engineering) I began shaping my leadership skills, giving me a great opportunity to learn in a practical way, and do something I love simultaneously. I began my career at Ford Motor Company in Livonia, Michigan as a Workstation Optimization Engineer in Powertrain Manufacturing Engineering. In July, 2016, my focus became Process Engineering in global, Flexible Cylinder Head Assembly. My time spent launching cutting edge manufacturing systems on the plant floor has been an incredible learning experience. With nearly two decades of hands-on mechanical diagnosis and repair experience, I was raised in the garage, tools in hand. Now, I'm working on a team, becoming a leader, and striving everyday to accomplish a set of goals in a real world, corporate and manufacturing setting. I believe in blueprinting, building, assembling, and testing. My passion for automotive technology runs deeper than just getting behind the wheel, but I'm lucky enough to still get the chance in a big-block Chevy-powered, four-link Dragster. With a \"built, not bought\" engine and drive train, the passion for drag racing drives my success behind the wheel. I have formulated a set of goals both short and long term for my racing program and my career. Of course, these goals, and my success, would not be obtainable without the help and knowledge of my father and mother, Gerard and Sherrie, who have taught me just about everything I know.", "word_count": 342, "quality_score": 342, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "executive", "url": "https://about.me/dannymeyer", "rank": 7, "retrieved_at": "2026-01-25T22:49:10.283552", "selected_bio_text": "Although I am no longer in the classroom, it is difficult to define myself as anything other than a teacher. I have taught multiple high school subjects, including: American History, Contemporary Moral Problems, World History, Psychology, Ethics, and Sexuality Education. Through teaching, I have promoted values of critical-mindedness—privileging application over memorization, discourse over argumentation, uncertainty over faith, audacity over compliance, and activism over consumerism. I believe instructional objectivity is a myth and teacher neutrality is unattainable, let alone desirable. I think we do our students, and our world, a disservice by pretending we are unbiased. I advocate “principled authenticity” for teachers—reminding our students (without problematically oversharing or exploiting them for therapy) that we, too, are learning side by side with them…that we, too, are just doing our best to figure it all out…that we, too, have struggles and fears…that we, too, are unavoidably human. My own education has focused on African American History, White Antiracist Identity Formation, Masculinity, Adolescent Moral Development, Ethics, and Social Justice Education. I have been sober for going on three years and speak openly about it, attempting to minimize stigma and shame. I am an ethnically Jewish atheist, happily married to a wonderful Cuban American Christian woman who endures my shenanigans and inspires me to be a more patient and compassionate man. My favorite writer is James Baldwin, my favorite movie is Do the Right Thing, and my favorite Hip Hop album of all-time is Nas’ Illmatic. I have a tattoo of John Brown on my arm to remind me that there is always more I can personally do in the fight for justice. I worry a lot about serious issues but try not to take myself too seriously. My family and friends help a great deal with that. They are never too hesitant to laugh at me and help me laugh at myself. I have such a wicked sweet tooth that I would eat candy from the floor of a subway platform. I would also be more than happy to subsist entirely on cereal. I was born and raised in Chicago and went to Evanston Township High School before graduating summa cum laude from Washington University in St. Louis ('02, A.B; African American Studies) and earning a master’s degree from Harvard University Graduate School of Education ('05, Ed.M; Human Development and Psychology).", "word_count": 387, "quality_score": 387, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "fisherman", "url": "https://about.me/benvu", "rank": 8, "retrieved_at": "2026-01-25T22:50:20.955342", "selected_bio_text": "I love fish. From the anatomy of their gills to the thrill of reeling in a big one, fish hold the key capable of unlocking the floodgates of dopamine to my brain. I am an avid fisherman and spend the majority of my summers at various bodies of water chasing the thrill of landing the biggest catch. My favorite species to fish for is the largemouth bass because of how hard they fight. The exhilarating feeling of my line sinking deeper into the water as I try to bring the fish onto land truly captivates me. I get so lost in the moments on the bank that I even forget my own needs and can go fishing all day without eating or drinking. When I fish all the chaos in my head grows quiet and my mind narrows in on just me, the line, and the water. Suddenly I become aware of everything else around me. I can hear the chirps of the birds in the trees, I can feel the mud and dirt beneath my feet, and I can smell the wet grasses that come up shallow on the shore. Although I love to catch fish, I hate eating fish. The fishy taste and strange texture found in most cooked fish has offended my taste buds since early childhood. Nearly every time I catch a fish, I will release it back into the wild to enjoy another day. In the spirit of adventuring and testing new waters, I have been enjoying more fish in my diet thanks to the UGA dining halls. My current favorite fish dish I have indulged in so far was the “miso glazed catfish” in the Oglethorpe Dining Commons. As I continue to grow and my perspectives continue to change, I hope that the UGA dining staff will allow me to be able to more fully appreciate fish. Parallel to testing new, uncomfortable things like eating fish, writing too often gives me a bad taste in my mouth. I consider myself a poor writer and frequently have trouble finding a deeper than surface level understanding of the passages and texts I was forced to analyze throughout high school. I am grateful for achieving a 4 on my AP English Literature and Composition exam which has exempted me from taking ENGL1101, but I am also hopeful and curious on learning how to elevate my writing and textual analysis during my time in ENGL1102.", "word_count": 407, "quality_score": 407, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "hunter", "url": "https://about.me/nathaniel_hunter_graham", "rank": 9, "retrieved_at": "2026-01-25T22:51:28.345015", "selected_bio_text": "Never known through his pseudonym \"ThePuzzledboy\", Hunter Graham does not wanting you calling him Nathaniel. It's his first name, and he considers it a strange, if fitting, name. He also wonders why he's talking about himself in the third person other than to look the tiniest bit professional, but darn it, he's gonna continue anyway because he's a stupid and either humble or self-deprecating human being. He honestly can't decide which. Born to a hard-working mother and a deplorable, miserable father (who no longer lives with either) in Dallas, TX on January 9, 1998, Hunter and his family moved to the small town of Rockdale in 2000. From the beginning, he has had a strange interest in technology and a huge love for retro computing, reflected by his interest in science fiction, and later his current favorite TV show, Doctor Who. Similarly, he loves video games, specifically retro gaming. This was primarily helped by his first gaming console, the Nintendo 64 (a console that he can still use today, and no, it is not going to be sold in the foreseeable future), being the only console he ever owned until Christmas 2009, when he received a Wii for a Christmas gift. Speaking of video games, retro gaming, and British things, another favorite franchise of his (unironically) is Sonic the Hedgehog. He loves some of the games (and hates others, enjoyed the Archie comics (up to a point, one in particular supergenesiswave), likes the TV shows (again, up to a point sonicx), loves watching the OVA, and absolutely loves the strangely intriguing yet obscure Fleetway comics (y'know, the one with the evil Super Sonic). Other interests include memes (dated and dead ones in particular), online video creation, denim suits, TV Tropes (they're really not kidding when they say they'll ruin your life), YouTube Poops (seriously, they are SO underrated), Linux, criticizing things (nowadays trying to have the best of intentions when doing so), referring to himself in the third person, animation, comics, and the Department of Redundancy Department. (see what I mean? They're REALLY not kidding)", "word_count": 345, "quality_score": 345, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "janitor", "url": "https://about.me/tcyhuang", "rank": 8, "retrieved_at": "2026-01-25T22:52:32.853723", "selected_bio_text": "Tony is a cross border investment professional with nearly two decades of experience in Silicon Valley and Asia’s venture capital industry. Extensive knowledge of venture lending, direct investment, venture fund investment, and corporate development, with emphasis on US and Asia cross-border transactions. Since 1995, Tony has been an active participant in Silicon Valley and Asia’s venture capital and entrepreneurial ecosystems, serving as an investment professional, angel investor, trusted advisor, and a catalyst to facilitate entrepreneurial value creation and capital formation. Completed over $300 million in venture debt financing to over 200 companies, invested in 35 privately-held technology startups, sponsored over 25 venture capital fund investments, and established an extensive network of relationships with venture capital firms, limited partners, entrepreneurs, corporate executives, and service providers on both sides of the Pacific. Tony has financed and invested in many market leading companies during early stages of the companies’ development, including Fortinet (FTNT), PayPal (Acquired by eBay), Marvell (MRVL), PowerSet, (acquired by Microsoft), Silicon Motion (SIMO), SMIC (SMI), TransMedia (acquired by Cisco), BCDsemi (BCDS), Carbonite (CARB), among others. Tony was most recently an investment professional at NXT Capital Venture Finance, a Chicago-based specialty finance company with over $3 billion under management. Tony was responsible for establishing the Silicon Valley operation for NXT in 2008 and was responsible for sourcing and executing senior and subordinated venture debt transactions ranging from $1 million to $20 million to venture-backed, growth stage companies in the technology and life sciences sectors. Prior to NXT Capital, Tony served as a Vice President of United Commercial Bank’s Technology Banking Group where he focused on leveraging the bank’s unique cross-border commercial banking capabilities to provide working capital financing to later stage technology companies in Silicon Valley and Greater China. Tony started his venture finance career in 1995 with Silicon Valley Bank (“SVB”). From 1995 to 2004, Tony assumed a wide variety of roles within SVB, initially as a venture lending relationship manger, and most recently as Director of Asia Pacific Business Development, where he was the sole dedicated business development professional responsible for marketing SVB to the Asia-Pacific technology, life-science and venture capita To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 372, "quality_score": 372, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "journeyman", "url": "https://about.me/jeremypatmartin", "rank": 1, "retrieved_at": "2026-01-25T22:53:39.897935", "selected_bio_text": "Hello, I am Jeremy Patrick Martin, and I have been an experienced electrician since the spring of 1994. I have a long and demonstrated history of working in the construction industry. I am highly qualified for power and communications installation, troubleshooting, and repair with several decades of field experience from commercial, industrial, and military civilian construction contracts. I have worked as an electrical specialist for Google data centers and also have done automation and data work for Amazon. I am proficient at troubleshooting and repairing robots and automation at Ford plant Norfolk, and cranes at shipyards, as well as shipping terminals. I am skilled in data, communications, electrical wiring, and troubleshooting controls. I graduated with an Electrical Journeyman's License with Certifications from Tidewater Joint Apprenticeship and Training Committee five year class of 2001. My Journeyman's license is always kept up to date with continuing education. I have been working with computers since the mid 1980's and I enjoy coding with HTML & CSS although I have no formal training for it. I have done occasional freelance website development in the past. I have taken several years of music lessons which means I can compose music notation. I am proficient in percussion, lead guitar, keyboards, and vocals with decades of live stage experience. I am extremely proficient with the five string electric bass guitar, which is my instrument of choice, playing all genres with a specialization in funk rock, which is my preferred style of music. I can also play by ear, improvise, and I have a well seasoned and professional stage presence interacting well with most audiences. I am effective at profitably monetizing a band. I am unaffiliated with any political party. I enjoy studying political and economic science and history. My current reading list is so hefty that I have resorted to audio books while driving. My favorite topics are: U.S. history of Reconstruction into the Progressive era, The Spanish Revolution of 1936, and the world history of labor in general. I am a vocal pro-labor, pro-civil rights, and anti-establishment centered secular progressive freethinker. I am unapologetically atheist. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 369, "quality_score": 369, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "lawyer", "url": "https://about.me/ramiamaro", "rank": 5, "retrieved_at": "2026-01-25T22:54:41.343893", "selected_bio_text": "Rami Amaro is a trial lawyer with more than 18 years of experience in the areas of Aviation, Corporate, Employment and Insurance Law. While enrolled in law school, Rami served as an intern for the Federal District Court in Northern Kentucky and as a Legislative Research Intern for the Kentucky Municipality Association. Upon graduation from law school, she relocated to Coeur d’Alene, Idaho, where she worked as an Associate Attorney at Ramsden & Lyons. In 2000, she joined Johnson Law Group, but soon founded the Amaro Law Office, at which she served as managing partner until 2014. During her tenure at the Amaro Law Office she consistently demonstrated that she is a dedicated attorney who works tirelessly on behalf of her clients. During her career spanning almost two decades, Rami Amaro has held a myriad of professional roles including, but not limited to: Pro-Tem Judge for the Kootenai County DUI Court; Special Deputy Attorney General and Administrative Law Judge for the State of Idaho; Legal Instructor for Lorman Education; Arbitrator for NASD/FINRA; and an Idaho Supreme Court certified Mediator. She is licensed to practice law in Idaho, Oregon, Washington, and Ohio. Rami Amaro joined Medflightone LLC in 2014 where she currently serves as the Vice President and General Counsel. Rami has extensive experience and knowledge in business leadership, including but not limited to the areas of human resources, marketing, growth management, startups and more. Rami Amaro has dedicated her life to helping people less fortunate than her. She has engaged in extensive pro bono work, primarily assisting victims of domestic violence as well as fighting their insurance companies for medical coverage for needed treatment. Rami is passionate about “paying it forward”, recognizing that she should do her part to help others. She firmly believes that a large part of one’s life should be dedicated to making the world a better place. For more from Rami, check out her blog.", "word_count": 319, "quality_score": 319, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "locksmith", "url": "https://about.me/foxlocksinc12", "rank": 8, "retrieved_at": "2026-01-25T22:55:40.516830", "selected_bio_text": "An Unbreakable Combination GURNEE'S LOCKSMITH SPECIALISTS Fox Locks Inc. has provided thousands of locks, access systems, CCTV, and safes of every make and grade conceivable to our Northern Illinois clients. Moreover, our locksmiths treat our clients as valued business partners. That is, we treat all of our clients as equals and value their input so that the end result satisfies both parties. Not everyone needs the latest-and-greatest technology to protect their bicycle or moped. We will help you find the ideal locking system to meet your unique needs without breaking the bank. To do so, we will arrange a free consultation as well as a free inspection of the vicinity or object that needs protecting to devise a custom security plan for you. We provide lock picking, and installation services for the industrial, banking, residential, forensic, and transportation sectors. Fox Locks Inc. was started over 19 years ago by one of its’ owners Brian Batz, a C.M.L. (Certified Master Locksmith) Accredited by ALOA (The Associated Locksmiths of America) Fox Locks is the only Lock company in northern Illinois Run by a Licensed, bonded, and insured Certified Master Locksmith. Here at Fox Locks we believe in having the right tools for the job and doing things the right way the first time. You won’t find any untrained do-it-yourselfers learning on the job at your expense. We have been doing this for almost 28 years and only use quality products, providing top notch guaranteed service. Fox Locks Inc. installs and services locks of all varieties, including deadbolt, doorknob, mortise, sliding door, car, safe, bike, master key systems, high security, and custom locks. We also install high-end systems that incorporate biometric and electronic access control as well as keyless entry systems. In addition, Fox Locks Inc. provides various lock picking, repair, and lock installation services. Our locksmiths also provide key repair and cutting services. No order is too big or too small for Fox Locks Inc. We have yet to find a lock we couldn’t pick or a client we couldn’t protect. Contact us today to discover the Fox Locks Inc. difference. Access Control in Gurnee, Rekey Services in Gurnee, Locksmith Services in Gurnee, Locksmith Near Me, Emergency Lockout in Gurnee https://goo.gl/maps/NDsAqkwiZMp3SBvs5", "word_count": 369, "quality_score": 369, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "magician", "url": "https://about.me/heatherrogers", "rank": 7, "retrieved_at": "2026-01-25T22:56:41.569725", "selected_bio_text": "BIOGRAPHY Heather Rogers is an award winning magician and motivator who has presented magical programs at over 3,500 public and private events ranging in all sizes and venues, ranging from Barack Obama’s Inaugural Ball in D.C. to the Wonder Dome in Las Vegas. As a trained actor and solo performing artist Heather has also written and produced 5 one-woman shows that ran in many theaters in San Francisco including Venue 9’s Women’s Work Theatre Festival, The Shelton Theatre, The Marsh Theatre and many others. She has coached groups and individuals in sleight of hand magic and presented several trainings on “Magic for Marketers.” She has customized keynotes for organizations such as Oracle,Young Presidents Organization, Unisource, the National Speakers Association and many others. Heather’s is driven by the vision of helping others crack the code to their unlimited power and to live more magical lives. THE MAKING OF A MAGICIAN Heather performed her first gorilla show at age six. Her captivated family watched as she poured a glass of water into her pocket (having pinned a plastic bag inside the lining), she then made her stomach growl like a drum beat (by pulling a radio cord out from under her coveralls and plugging it into the wall socket). After this command performance, her destiny was sealed. When Heather was 20 years old, she followed her heart and ran away with the Pickle Family Circus and became their first Technical Apprentice. That year her dream of performing with the Pickles came true when she was a featured performer in their winter season run at the Palace of Fine Arts Theatre in San Francisco. Heather’s circus apprenticeship opened the door to a 6 year career Free Lance Theatre Technician. During that time Heather served at the Technical Director of the San Francisco Mime Troupe and Olivier Entertainment. In Her serendipitous journey to becoming a professional magician Heather had many life experiences that continue to contribute to her life as a working artist. She has done everything from driving a school bus for 7 years, to teaching performance skills to inner-city youth, to performing in a professional dance company. The discovery of sleight of hand magic was a revelation to her because it elegantly joined together her love of performing, craft and her inquiry into the nature of consciousness. She has been delighting audiences with her magic professionally sin To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 415, "quality_score": 415, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "manager", "url": "https://about.me/evanbcarr", "rank": 2, "retrieved_at": "2026-01-25T22:57:45.608804", "selected_bio_text": "I am not defined by the positions I have held (see below). I am defined by the content of my character and the essence of my being. I believe in taking total ownership of one's life, embodying integrity in all that we do. --- This means doing what I say I'm going to do and being dillegent enough to get it right the first time yet humble enough to admit whenI don't know, but I will find out --- It means aligning my present actions with my principles and core values --- Integrity, Humility and Perseverance --- At the end of the day, I am solely responsible for my own actions, a gift I do not take for granted. I am a lifelong student of the entirety of life itself, from business to sprirituality to the most inane subject; life is wonderful. I am perfect in my flaws and always progressing. Like us all, I was blessed with a set of gifts, ones which throughout my life I will leverage for the mutual benefit of myself and the world. I am an expert in Unmanned Aerial Vehicles and drone integration in the United States. I have published twice on the industry and speak to interested audiences as well. I currently work as the Manager of Sales Development at AppFolio where I lead a team of 20 SDRs. Previous to this, I was the Regional Sales Manager for Lanyon, responsible for the Western half of the United States and a team of 10. I was also the Director of Research and Development for a growing wholesale electronics recycler. You can view my LinkedIn here --> https://www.linkedin.com/in/evanbcarr I am the former Director of Operations at JustGood.org, a Bill Archer Graduate Fellow, Former Research Associate at the National Center for Policy Analysis and Marketing Manager at Sunstone Yoga North Dallas. I graduated from the Univerity of Texas at Dallas in 2013 finishing my Master of Public Policy degree. I've published twice on unmanned aerial vehicles and am fascinated by innovation and entrepreneurship. My passion lies in creating where nothing exists and I spend my free time keeping my finger on the pulse and iterating new business plans.", "word_count": 364, "quality_score": 364, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "mayor", "url": "https://about.me/mrculbreath", "rank": 8, "retrieved_at": "2026-01-25T22:58:50.140152", "selected_bio_text": "Mayor Terrence Culbreath serves as the 13th Mayor of Johnston, South Carolina. He is a Johnston native and left the small town after high school to chase his dreams. Culbreath’s personal pursuit of happiness landed him in incredible places. He has done everything from working for NASCAR to producing Grammy nominated songs. During his travels he gained a unique worldview and eventually made his way back to Johnston with a passion to make an impact in his hometown. Mayor Culbreath is the youngest mayor ever elected in the Town of Johnston at age 31 and currently at 35, is the youngest 2 tern mayor in the state of South Carolina. Mayor Culbreath has used his time in office with the mission of \"Moving Johnston Forward\", by focusing on economic development, investments in recreation and quality of life. Prior to his election as mayor in 2014, Culbreath served two years on Johnston Town Council where he focused on improving both the Public Works and Police Departments as well as community infrastructure to attract new businesses and residents. Terrence serves on a wide variety of boards and community organizations including, MASC (Municipal Association of South Carolina) Executive Board of Directors (Columbia, SC), and Executive Committee member SCCBM (South Carolina Conference of Black Mayors) to name a few. In addition to his work with the Town of Johnston, Mayor Culbreath strives to cultivate relationships with local churches, community organizations and stakeholders such as Edgefield County Schools, and Edgefield County Peach Growers to build his coalition of true Johnston believers. “Distance creates distortion” is a quote by Pastor Carl Lentz that Culbreath lives by. This specific quote hits home for him because he says that “it tells a lot about how we live and interact with the world today. So many people have opinions or points of view on people, issues and subjects but they are so far from that their point of view is distorted and sometime even toxic.” Outside of his day-to-day duties as mayor, Culbreath loves to explore his other passions. Little-known fact he actually owns a photography company (Culbreath.Photography) and political consulting firm (Eighty3Media & Consulting). As you can see Mayor Culbreath embodies the role of a renaissance man and a future statesman. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 393, "quality_score": 393, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "medical student", "url": "https://about.me/chadteven", "rank": 4, "retrieved_at": "2026-01-25T23:01:09.675017", "selected_bio_text": "A medical student at the University of Chicago Pritzker School of Medicine, Chad Teven has taken a temporary leave from his medical studies to work as a Research Fellow at the Molecular Oncology Laboratory and the Laboratory of Craniofacial Development at the University of Chicago. Working under the auspices of Dr. Russell R. Reid, Chad Teven’s research focuses on tissue regeneration and craniofacial biology. His work explores new methods that repair facial skeletal damage, focusing on the role of a self-assembling peptide (Q11) that has the potential to facilitate bone growth and the potential use of Pulsed Electromagnetic Field Therapy (PEMFs) to repair defects in the craniofacial skeleton. Interested in plastic surgery and tissue regeneration, Chad Teven often delivers presentations on these topics to the medical community. Chad Teven has co-presented at medical conferences, discussing research that focused on new means of implementing pulsed electromagnetic fields to accelerated differentiation in stem cells, as well as the use of pre-mastectomy sentinel lymph node biopsies to improve breast reconstruction results. He and fellow researchers also presented studies related to bariatric surgery body contouring and the risk of malignancy in pancreatic duct strictures. Chad Teven received the Best Paper by a Medical Student Award at the 49th Annual Meeting of the Midwestern Association of Plastic Surgeons in 2010. Chad Teven donates much of his time to medical and charitable causes. Between 2008 and 2009, he filled the office of President of the Plastic Surgery Interest Group and assisted in the planning of the First Annual Medical Student Day at the annual American Society of Plastic Surgeons conference. As the President of an Adolescent Substance Abuse Program, Chad Teven educated Chicago teens and children about the dangers of drug and alcohol abuse. In 2010, Chad Teven traveled to Honduras as a medical volunteer, and in 2008, he served in Peru with Remedy, an organization that distributes exposed but unused medical supplies to communities in the developing world. Chad Teven majored in Brain, Behavior, and Cognitive Science at the University of Michigan in Ann Arbor and graduated summa cum laude with his B.S. in 2007. He expects to receive his M.D. from the University of Chicago To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 381, "quality_score": 381, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "musician", "url": "https://about.me/karenperryjuliano", "rank": 2, "retrieved_at": "2026-01-25T23:02:22.793771", "selected_bio_text": "Karen Perry was born and raised in Jacksonville, Florida and from an early age developed a passion for music. Born into a musical family, it was evident that Karen inherited that passion, and has gone on to create a unique vocal style that has made her a popular and sought after artist around the Florida music scene. She plays guitar, piano and writes. In addition to her solo work, she is also the other half of \"take two\" an acoustic duo with Scott Verville. She is currently seeking an opportunity to step out of the box and try something new with a full band. Her new release \"Perfume and Gasoline\" was written by Barbara Wilkinson, Sonya Wood and Tony Gunter. It was produced and recorded at QUAD Studios in Nashville TN. Karen was heavily influenced by a variety of genres, including Classic Rock, Blues, Country, Top 40 and good old fashion Rock'N'Roll, These combined helped develop her powerful Blues/Country voice. She has always believed in giving back to her community by offering her talents to a variety of charities and events to help the less fortunate and bring awareness to causes close to her heart. I would without a doubt say, my children, are my greatest accomplishment. However, my next music journey was just as important. I am 100% positive that I was born to be a part of it in some way, shape or form. I am honored. ‪#‎Music‬ is powerful enough to change lives. ‪I was asked to sing the theme song for The documentary, \"Ashleighs Patience Project\" it tells the story of the brutal events that took place on Friday, July 13th, 2012. No woman, child or family should ever have to go through this. Her story was also in COSMO Magazine. Unfortunately, I was unable to honor her memory with my music due to my schedule. However, I will continue to share her story every chance I get! Please visit the website: http://www.ashleighspatienceproject.com/ ♥ Thank you Tara and Jim Woodlee for sharing Ashleigh with all of us ♥ \"I can’t remember a time in my life where music wasn’t present. Music heals my soul. It is therapy for me. It is my best friend and always there. It’s so amazing to look out into the crowd and see a foot tapping, a smile on someone’s face, somebody singing along with me or dancing. I am very grateful for the gift I’ve been given. \"My children keep me grounded and my music keeps me sane” Thank you for reading.", "word_count": 422, "quality_score": 422, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "nurse", "url": "https://about.me/kimberlyrice", "rank": 3, "retrieved_at": "2026-01-25T23:03:24.541218", "selected_bio_text": "I am a Registered Nurse who has earned her ADN at Everett Community College. I am finishing up my BSN program and I am set to graduate in June 2020 along with a Double Major in Health Studies from the University of Washington Bothell. I have wanted to gain a more developed public health aspect to enhance my nursing care for the more vulnerable patient populations that I care for in the hospital setting such as the homeless. That being said, my interests in public health is to figure out how to better help more vulnerable populations outside of the hospital setting within my individual practice as a healthcare professional in the hospital setting. Before I became an RN, I worked as a CNA in a memory care unit at an assisted living facility where I was able to work with residents who have various severity dementia levels for about 4 years. I have been an RN since January 2019 and currently work on a renal-telemetry acute care hospital unit at a major hospital. I am eager to continue to grow and learn in my current role as a Med-Surg RN. I aim to develop professionally by gaining experience to be able to apply to a DNP program where I can further develop what I have learned as an RN and improve my leadership and care management skills. I would also like to become more involved in creating health policies, especially for those involving vulnerable populations. As a part of my previous academic experience in health, I found my interest in policies by creating a research paper about the DSHS CARE Tool that is used to help people with serious medical conditions or disability to get adequate one-on-one care hours paid for by the state of Washington. It was found that psychological medical conditions were not analyzed the same way as physical medical conditions even though both medical conditions can drastically affect how people live outside of the hospital environment. As a result, I emailed Washington State Legislation about this issue and it is currently under review. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 367, "quality_score": 367, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "officer", "url": "https://about.me/arthurbrockman", "rank": 1, "retrieved_at": "2026-01-25T23:04:35.194435", "selected_bio_text": "A retired Lieutenant Colonel, Arthur Brockman completed 22 years of service in the United States Air Force, including 14 years of active duty and 8 years in the Air Force Reserves. His service included contributing to combat operations in Desert Storm. During an operation in Saudi Arabia, Art Brockman held the position of Chief of Flight Safety. His military career history also includes serving in positions such as F-15C Pilot, Air Liaison Officer, Wing Executive Officer, Squadron Executive Officer, Flight Commander, and Assistant Operations Officer. As a skilled pilot, Brockman served as the leader of the command-winning team of the 1989 ATC Torchlight competition. Active in a range of capacities during his military service, Brockman obtained Top-Secret Security Clearance. He also gained full membership with the International Society of Air Safety Investigators. Although retired from the United States Air Force, Art Brockman remains active as a pilot. Currently a member of the Southwest Pilots Association, he serves as a B-737 Captain for Southwest Airlines, based out Oakland, California. He resides in El Dorado Hills, a suburb of Sacramento. Arthur Brockman holds a diverse academic history. An honors graduate of the University of Missouri, he completed his Bachelor of Science in Agriculture and Biological Sciences in 1985. He subsequently attended Northwestern Oklahoma State University, completing a Master of Education in International Relations in 1992. In the Air Force, his educational background includes graduating from the USAF Aircraft Safety and Systems Management Course at the University of Southern California and the Air Force Academic Instructor School. Art Brockman also completed military training at Squadron Officer School and Air Command and Staff College. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 290, "quality_score": 290, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "paramedic", "url": "https://about.me/dawn.altemus", "rank": 10, "retrieved_at": "2026-01-25T23:05:40.882204", "selected_bio_text": "I grew up in the Malvern area and now live in West Chester. My first career was in EMS working as an EMT. I was ready to take the exam for paramedic when I had a career ending injury. I tried my hand at dispatching but it wasn't for me. I returned to school and found my new passion. I earned a Bachelor's degree from Drexel University in Behavioral and Addictions counseling. This gave me the opportunity to start my new career in mental health with Horizon House Inc. I've been working with Horizon House since October 2007 at their Community Crossroads Peer Support Center site. When I started with Community Crossroads I was working on my Master's degree in Psychology at University of Phoenix. The online experience was very challenging and having this advanced degree has already opened doors for me. Working at Community Crossroads has been both challenging and enlightening. It gives me the opportunity to combine my scholastic knowledge and the real life knowledge I have gained from learning how to deal with my Bipolar disorder. Community Crossroads operates like a \"drop-in\" center. Everyone who comes is there voluntarily, and everyone who comes is in a different place in their recovery. Some are very active in their recovery others are there for \"a place to be\" because they're also dealing with homeless issues. I'm still with Community Crossroads but was promoted to Recovery Support Coordinator in April. I am now the coordinator in charge of the CommonGround project. CommonGround is a web based program designed by Pat Deegan (if you don't know who she is, look her up. Her story is incredible - you can also go to patdeegan.com). CommonGround is designed to help mental health consumers communicate more effectively with their treatment team...primarily their psychiatrist. In addition, there is a HUGE resource library attached to the program. All resources have been verified for reliable content and all contain very little to no advertising. Coordinating this program has been a challenge beginning with when we worked to educate the providers about the report and how it can improve their relationship with the mental health consumers they treat. Personally, I'm easy going but I hate when people are fake. I also don't like stereotyping or oppression. I get especially frustrated with the way people with a mental illness and those who are homeless are treated. I have advocated in many areas for many people. I prefer open minded people who are not afraid to speak their mind about injustices where ever those injustices occur. There are many people who are in need and who do not know how to seek out that help. Many need an advocate and I am proud to call myself one. I especially like others who will do the same. I've been accused at times of going too far. I don't think there is such a thing as too far when an individual truly wants help and is doing everything they can do to try...a break and some support need to come from somewhere. Mind you, I'm talking about people who are trying to get better and/or better their own life. As far as me going too far, if it helps it's worth it...even if I go through a period of time where things may be uncomfortable for me. If it's the right thing to do, then it's the right thing to do. To quote Laurel Thatcher Ulrich, \"Well behaved women seldom make history.\" To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 600, "quality_score": 600, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "photographer", "url": "https://about.me/mannguyen", "rank": 8, "retrieved_at": "2026-01-25T23:06:53.732684", "selected_bio_text": "To answer your very first question, you can call me Manny. Nice to meet you! And my last name is pronounced “win.” I am a full-time wedding photographer. I moved to Pittsburgh in 2009 from San Diego, CA. What am I doing in Pittsburgh? Oh, I got sick of the clear skies, the multiple beaches, and the 60 degree winters. Not really. I decided to move here to be closer to family and to start a new life. A month after I moved here, my family packed up and moved back to California. Wait… what? No hidden meaning behind the sudden move right guys? …Guys? Pittsburgh greeted me with a hearty hello and a blizzard of the century. It was my first snowy winter ever. I had nothing more than a windbreaker and my snow shoes were mesh running shoes. Thank you Pittsburgh for showing me what it is like to walk in 6 inches of snow with “tennies” on. But life has been great here. People here are truly wonderful. I can say I became a Pittsburgher when I bought my first lawn chair to save my parking spot. What were we talking about? Oh, weddings. Yes, I am a wedding photographer. I was trained at San Diego City College. Since then, I got into wedding photography, trained with other professional photographers, and have been running my own small business ever since. You may have seen me on TLC’s Four Weddings(they won!). I wanted to specialize in taking photos of happy days. Wedding photography is hard work but when clients proudly show off their photos–there are no other happier feelings for me. I want you to have the simplest and best experience with your wedding photographer. Why? Because I will be at your side all day! You’re going to have to love your photographer if you’re going to make it through to the end of the day. I want your experience to be easy, fun, and beautiful. I know some clients just wants the photos and don’t care about the experience. Because of that, I may not be a fit for every client. That is OK! I care about making sure your photography needs are met and that your wedding day goes as smoothly as possible. We may only know each other for brief moment but years from now I want you to be able to think back and say, “My wedding photographer, Manny, he rocks! My first born is named after him!” To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 434, "quality_score": 434, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "police cadet", "url": "https://about.me/racarrera", "rank": 2, "retrieved_at": "2026-01-25T23:08:05.165338", "selected_bio_text": "Contact me here if you're so inclined. If you want to hear what I'm listening to, go here to see my Bandcamp collection! A bit difficult to meet people here except as a way to trade business cards, but that's alright... I came across about.me many years ago when it was just starting up, and I used the site as a digital business card of sorts. Seeing how creative others have been with theirs, I feel a bit silly for putting up what sounds like a stodgy page. Now, for a simple introduction, though broken down a bit because I do a lot of stuff... First and foremost, I am a teacher based in Tbilisi, Georgia, with a background of teaching English (ESL, ELA, AP), History, Geography, Music Appreciation, and Film & Media classes.", "word_count": 134, "quality_score": 134, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "programmer", "url": "https://about.me/ankit_choudhary", "rank": 5, "retrieved_at": "2026-01-25T23:08:26.165731", "selected_bio_text": "Born in the princely state of Ahichatragarh in the Thar Desert. My father being an Engineer in States PHED Department given me ample opportunities to learn and explore. The burning sun and the piercing winds shaped my dreams and the turning life and the fierce struggles shaped my destiny. I am a post graduate, Masters of Technology in Computer Science & Information Security from International Institute of Technology, Hyderabad. Passionate about computers, since the days, I was in B.Arch. in MNIT Jaipur. They say never do the thing you don't love, and never commit to a work you can't do. Joined BMIT, joined late but it was all about computers. Then came the web development phase, started a startup in my 3rd year, faceboox.in. I still smile at the naive idea of doing it. Used to sell college books through that portal. We touched technology, and we touched it hands on, but we were not good, we were just kids toying around with the spirit of Wannabe Entrepreneurs. Year 2011 qualified gate, 2012 qualified gate and got into IIIT Hyderabad. This was the dream, so many smart people and so much to get exposed to, so much to learn. We were the lucky 10 who got into CSTAR Labs. Worked with the most dedicated people in the field of security. But I was mostly interested in Algorithms and Data Structure, These were the basics, the vary soul of computing, but learned the difference between doing simple things and doing almost perfectly. A production quality code is like a poem. And you are the poet who write it, once you get a taste in that. Its hard to resist. I started my career as a Software Developer in the core Development Team at Vinculum Solutions, a software solution to handle problems Sellers face on different eCommerce platforms, to sell and fulfill from a single platform and to keep a better production value to keep better Seller Ranking. It works as a marketplace integrator, channel integrator, transporter integrator, inventory manager, crm manager, vendor manager, an independent seller panel. I used my skills to make, optimize or to break and make better features in the system. I love what I do to earn my bread and butter, imagine and create. Imaginations have no ending, but grass root reality is totally different. Its an architects job to make the floor plan and its useless to find flaws in layout. But as a developer my ethos is, you should always meet a certain level of quality in your work so that no one can find flaws in your structure, to get To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 456, "quality_score": 456, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "scientist", "url": "https://about.me/andrewldufresne", "rank": 1, "retrieved_at": "2026-01-25T23:09:45.802475", "selected_bio_text": "Dr. DuFresne is a scientist with a passion for teaching and sharing the joy and wonder of learning about how the world works and how we work. He’s enjoyed tutoring and guiding students to their academic goals since his own days in high school. His efforts and achievements allowed him to enter the research lab early in college and prepared him to assist his course professors with generating materials, creating exams, and leading help sessions for more than half of his college career as a biochemistry major at Worcester Polytechnic Institute. His doctoral research at The Johns Hopkins University School of Medicine focused on molecular biology and virology and used drug intervention and radiation treatments to combat viral-associated blood-based cancers in human cells. Despite a lifelong avidity for cancer research and contributing to the pursuit of novel treatments, though, his favorite roles in science are to share it with others, help educate the public, and inform policy. Dr. DuFresne is developing a consortium of programs – So”sci”etal, Cortical Communications, and Evidentiary – within his own organization, the Integrated Scientific Inquiry and Engagement Consortium (ISIEC, pronounced EYE'-seek). Through So\"sci\"etal, ISIEC aims to advance science education with the MESH perspective, a cross-disciplinary, integrated style focused on blending Math, Engineering, Science, and Humanities and highlighting connections between science, history, economics, politics, and philosophy. Cortical Communications produces original science communication content as well as workshops for project management and organization building. Evidentiary delivers evidence-based and collaborative input from diverse sources for business engagements and policy decisions. Together, ISIEC explores the science behind it all. He has also founded Parlance Educators, a boutique education firm offering one-on-one academic and organizational tutoring, test preparation, and project and presentation consulting. Parlance is equipped to help students from high school to graduate school. More than just a reservoir of content knowledge, Parlance is all about relating that information to you, the student. Dr. DuFresne's goal is to concentrate his lessons learned and lessons taught into his work tutoring students. He has accrued thousands of hours of one-on-one teaching and mentoring. And he is excited by all he will learn and by all the students he hopes to help in his work that lies ahead. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 386, "quality_score": 386, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "scribe", "url": "https://about.me/lauratate", "rank": 9, "retrieved_at": "2026-01-25T23:10:49.940208", "selected_bio_text": "I am a writer, editor, publisher, and social media strategist. At my company, Crackerjack Scribe, I help businesses enhance their online presence through authentic content and effective social media strategies. At Crackerjack Scribe, we offer a variety of services, including website design, editing, writing, as well as social media and content marketing consultation and training. I previously served as the Associate Publisher and Editor of the weekly newspaper, The Malibu Times, and the bimonthly lifestyle publication, Malibu Times Magazine. In addition to my professional work, I have a passion for dancing the Argentine tango. You can check out my website, Coffee and Tango. I also write for several blogs and maintain my interest in journalism by contributing to the Los Angeles Times newspaper group. To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 144, "quality_score": 144, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "slacker", "url": "https://about.me/clockcirrus0", "rank": 4, "retrieved_at": "2026-01-25T23:11:55.974352", "selected_bio_text": "Tunes downloads can be a fantastic way to enjoy your preferred artform in the convenience of your possess home or wherever else you may take place to roam. But, without some crucial details about downloading music, Songs Downloads Knowledge Directly From The Professionals might be at a decline. Preserve looking through for some excellent guidelines that can get you began. If you are seeking for a inexpensive way to download songs, consider making use of a free of charge services instead of downloading. Support such as Pandora or Slacker will let you pay attention to music from Songs Downloads Expertise Immediately From The Authorities . You do not have to retailer the documents on your telephone or pill just pay attention to them streaming on the internet. A fantastic idea to use when pondering about downloading tunes is to begin utilizing pandora radio. Pandora radio can be a excellent way to find out new tunes which is comparable to songs you presently like. You simply develop a station based close to a song or artist you like, and it will playback similar audio for you. If you actually really like an artist, check out out their web site for tunes. Most bands preserve an on-line existence where they provide information on tunes and excursions, and they will occasionally offer you free audio there. This may well incorporate in any other case unreleased tracks or a track off of a new album they are making an attempt to promote. A good idea to use when contemplating about downloading tunes is to make positive you are not tying up your internet relationship with other factors. You most likely want your tunes to obtain as rapidly as feasible. This implies you are going to want to halt anything at all that may possibly be using up any of your bandwidth. Totally free Audio Archive and The Internet Archive offer you totally free audio that is entirely legal to obtain. Check out them out if you are working on creating your assortment. They frequently incorporate tunes from obscure or lesser recognized artists, and the music spans every single genre. Downloading is easy as soon as you are at the website. Watch the file sizes of Music Downloads Knowledge Directly From The Specialists downloads cautiously. A regu To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 402, "quality_score": 402, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "software developer", "url": "https://about.me/shanechin", "rank": 2, "retrieved_at": "2026-01-25T23:12:58.469107", "selected_bio_text": "Hello! I'm a junior computer science student, eager to create. I'm a huge Bruce Lee fan, and an avid innovator. I love programming, I love bringing a project from concept to reality. I love hearing from like minded people, so feel free to contact me, there is an email link below. Roomi - Roomi is a Housing Review Application for Columbia, currently a work in progress. It is built on top of meteor, and backbone. Swap College - SwapCollege is an attempt at strengthening Columbia's sense of community by giving it tools to help students communicate. Version 1 of SwapCollege consisted of polls, teacher evaluations, file sharing, a reddit clone, and class discussions. We created something which was useful, but was on the complicated side. For our second iteration we decided to take a much simpler approach, where a student simply searches a course within Columbia's directory and is given as much information as possible pertaining to that course. (Closed Source) Hearst - Is a web application I am building which hopes to create a platform in which campus groups, and their members can talk more efficiently with one another. Students are generally oblivious to the cool things other student's are doing, hopefully hearst will be able to change that. To.day - To.day is an HackNYC hackathon hack, which attempts to give you an extremely brief over view of people and things mentioned in the nytimes. It allows you to get a detailed analysis of a specific topic, with links to the original sources, quotes from the articles, and analytics on their use. The lack of available indexing on Heroku's new Cedar platform slows down the intial page load, but you can still see the concept.", "word_count": 286, "quality_score": 286, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "trombonist", "url": "https://about.me/chino.rodriguez", "rank": 5, "retrieved_at": "2026-01-25T23:14:20.100005", "selected_bio_text": "1954 Birth Born on February 2, 1954. In 1968 at 14 Years Old The band's trombonist Belly gave Chino informal lessons during rehearsal breaks and it wasn't long before Chino formed his first band on the Lower East Side, simply called Chino Rodriguez and his Orchestra in 1968-69. Like most young bands, they rehearsed incessantly with paid gigs here and there, usually the round of weddings, birthdays, and private parties familiar to every young band. After high school Chino studied improvisation with the late Barry Rogers and Jose Rodriguez, trombonist in Eddie Palmieri's band. \"Barry Rogers and José Rodriguez... were the very best Salsa trombonists of the late 60's and early 70's\", Chino said in a 2010 interview. \"Between the two it was like going to Harvard and Yale. Barry taught me improv and sight reading and José taught me breathing and tone with power.\" That early playing experience inspired him to continue working with many bands and companies, large and small, within the music industry in the late '60s and '70s. He met Salsa artists and producers Larry and Andy Harlow and would often sing coro at their gigs. At parties and clubs all over the city Chino met and networked with Latin music pioneers such as Harvey Averne, the late Jerry Masucci, Ralph Mercado, and José Cubello. Chino told music journalist Ian Morrison, \"Back in the day once I started hanging out with Larry Harlow, things started to happen, I got more focused and since I met a lot of the promoters / club owners I started getting more work around the New York Area. In the 1970s heyday of Latin music in New York you had to be good to 'cut the mustard.' Chino moved to Florida in 2002 to use his new knowledge base and reconnect with the Tropical Salsa business. Chino's Booking Agency aquired many artist among his new clients was Emmy-winning Latino comedian Mike Robles, who grew up in the same area of Manhattan as Chino (as well as Jennifer Lopez). Chino booked Mike at college campuses throughout the country during Hispanic History Month and Latin heritage celebrations. \"Chino is smart, and he definitely knows how to market an artist\", Mike said in 2010. \"I was impressed by his passion for what he does. Chino's a tough negotiator but he's straightforward with you. He reminds me of old-school business guys, straight up, To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 418, "quality_score": 418, "low_quality": false}
{"run_id": "upgrade_08", "job_primary": "writer", "url": "https://about.me/carmenellen", "rank": 3, "retrieved_at": "2026-01-25T23:15:18.103437", "selected_bio_text": "I am a writer living in Saltburn, a strange Victorian Spa town. I have always been a writer, although my early critics didn't warm to my style 'minus 1 House-point, Weird' was my teacher's initial response. Undiscouraged, I continued to write about puking black sick after my First Holy Communion and my mother's saints - Padre Pio and his visions of demons. As the daughter of an Irish mother and fisherman father I come from a place where stories are scarce, sacred and alive. I took this place with me when I studied for my MA Honours in English Literature and Language at St Andrews. This was a furnace learning experience - forging skills I have used everyday since in arts, culture, education and business. Who we are as learners, how we learn and what we learn - are the crucial questions which have shaped my career. I have taught angry teenagers; unemployed men; cast out women; little poets; big dreamers in a variety of settings from formal education to the wild woods. What I teach is mostly how to learn using creative writing as a route in. My journey took me to ARC, an arts centre in the North East. Here I researched, designed and sourced funding for creative learning projects which tapped into the unique learning experiences the creative process can provide. Still orbiting learning I landed in Higher Education as a Community Engagement Coordinator - supporting the Third Sector to access digital learning. I then made the leap into Industry Engagement - researching and successfully sourcing funding for international projects which explored the space between what education provides and what industry needs for the digital sector. In each of these roles I employed all of the skills of story - understanding people; communicating a message; building a case; honest scrutiny; re-learning and making something of value. In 2013, after having encouraged so many individuals to take the leap towards independence, I took my own advice and became a Freelance Writer. My writer's story started young and when I picked up the thread again, my first manuscript 'How Saints Die' won New Writing North's Northerm Promise Award 2012 (not my only award, at 8yrs I won a Curly-wurly). How Saints Die will be published with Harvill Secker on 13th July 2017. I've performed poetry to a sell out show at the Southbank Centre during the Festival of Neighbourhood 2013. I've since been commissioned by the Royal Festival Hall to write and perform poetry as well as performin To ensure the best experience on our website, we recommend that you allow cookies, as described in our Cookie Policy.", "word_count": 439, "quality_score": 439, "low_quality": false}
